//关于文件描述符

//http://www.jianshu.com/p/5683c8a93511  拓展

/**
 flags 参数可以是以下值
 r	以读取模式打开文件。如果文件不存在抛出异常。
 r+	以读写模式打开文件。如果文件不存在抛出异常。
 rs	以同步的方式读取文件。
 rs+	以同步的方式读取和写入文件。
 w	以写入模式打开文件，如果文件不存在则创建。      ==》 writeFile
 wx	类似 'w'，但是如果文件路径存在，则文件写入失败。
 w+	以读写模式打开文件，如果文件不存在则创建。
 wx+	类似 'w+'， 但是如果文件路径存在，则文件读写失败。
 a	以追加模式打开文件，如果文件不存在则创建。       ===> appendFile
 ax	类似 'a'， 但是如果文件路径存在，则文件追加失败。
 a+	以读取追加模式打开文件，如果文件不存在则创建。
 ax+	类似 'a+'， 但是如果文件路径存在，则文件读取追加失败。
 * */


var fs=require("fs");
fs.writeFile("./module/note4.txt","未尾追加的内容",{flag:"a"},function(err){
	if(err) throw err;
	console.log("写入成功");
});